Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/sqi.h
/* -------- SQI_STAT2 : (SQI Offset: 0x130) ( R/ 32) SPI status 2 register -------- */
#define SQI_STAT2_RESETVALUE                  _UINT32_(0x00)                                       /*  (SQI_STAT2) SPI status 2 register  Reset Value */

#define SQI_STAT2_TXOV_Pos                    _UINT32_(0)                                          /* (SQI_STAT2) This bit would get set when TX FIFO OVERFLOW happens. S/W needs to monitor TX_FIFO_FREE when filling TX_FIFO to make sure TX FIFO doesn?t over flow or in case OVERFLOW bit gets set, then TX_FIFO_RST (bit 17 of SPI Configuration register) should be set which would then clear TX FIFO pointers and hence this bit would get cleared. Generally software should avoid getting into this condition. Position */
#define SQI_STAT2_TXOV_Msk                    (_UINT32_(0x1) << SQI_STAT2_TXOV_Pos)                /* (SQI_STAT2) This bit would get set when TX FIFO OVERFLOW happens. S/W needs to monitor TX_FIFO_FREE when filling TX_FIFO to make sure TX FIFO doesn?t over flow or in case OVERFLOW bit gets set, then TX_FIFO_RST (bit 17 of SPI Configuration register) should be set which would then clear TX FIFO pointers and hence this bit would get cleared. Generally software should avoid getting into this condition. Mask */
#define SQI_STAT2_TXOV(value)                 (SQI_STAT2_TXOV_Msk & (_UINT32_(value) << SQI_STAT2_TXOV_Pos)) /* Assigment of value for TXOV in the SQI_STAT2 register */
#define SQI_STAT2_RXUN_Pos                    _UINT32_(1)                                          /* (SQI_STAT2) This bit would get set when RX FIFO UNDERFLOW happens.  S/W needs to monitor RX_FIFO_CNT when emptying RX_FIFO to make sure RX FIFO doesn?t under flow or in case UNDERFLOW bit gets set, then RX_FIFO_RST (bit 18 of SPI Configuration register) must be set which would then clear RX FIFO pointers and hence this bit would get cleared. Generally software should avoid getting into this condition. Position */
#define SQI_STAT2_RXUN_Msk                    (_UINT32_(0x1) << SQI_STAT2_RXUN_Pos)                /* (SQI_STAT2) This bit would get set when RX FIFO UNDERFLOW happens.  S/W needs to monitor RX_FIFO_CNT when emptying RX_FIFO to make sure RX FIFO doesn?t under flow or in case UNDERFLOW bit gets set, then RX_FIFO_RST (bit 18 of SPI Configuration register) must be set which would then clear RX FIFO pointers and hence this bit would get cleared. Generally software should avoid getting into this condition. Mask */
#define SQI_STAT2_RXUN(value)                 (SQI_STAT2_RXUN_Msk & (_UINT32_(value) << SQI_STAT2_RXUN_Pos)) /* Assigment of value for RXUN in the SQI_STAT2 register */
#define SQI_STAT2_SQID0_Pos                   _UINT32_(3)                                          /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Position */
#define SQI_STAT2_SQID0_Msk                   (_UINT32_(0x1) << SQI_STAT2_SQID0_Pos)               /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Mask */
#define SQI_STAT2_SQID0(value)                (SQI_STAT2_SQID0_Msk & (_UINT32_(value) << SQI_STAT2_SQID0_Pos)) /* Assigment of value for SQID0 in the SQI_STAT2 register */
#define SQI_STAT2_SQID1_Pos                   _UINT32_(4)                                          /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Position */
#define SQI_STAT2_SQID1_Msk                   (_UINT32_(0x1) << SQI_STAT2_SQID1_Pos)               /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Mask */
#define SQI_STAT2_SQID1(value)                (SQI_STAT2_SQID1_Msk & (_UINT32_(value) << SQI_STAT2_SQID1_Pos)) /* Assigment of value for SQID1 in the SQI_STAT2 register */
#define SQI_STAT2_SQID2_Pos                   _UINT32_(5)                                          /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Position */
#define SQI_STAT2_SQID2_Msk                   (_UINT32_(0x1) << SQI_STAT2_SQID2_Pos)               /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Mask */
#define SQI_STAT2_SQID2(value)                (SQI_STAT2_SQID2_Msk & (_UINT32_(value) << SQI_STAT2_SQID2_Pos)) /* Assigment of value for SQID2 in the SQI_STAT2 register */
#define SQI_STAT2_SQID3_Pos                   _UINT32_(6)                                          /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Position */
#define SQI_STAT2_SQID3_Msk                   (_UINT32_(0x1) << SQI_STAT2_SQID3_Pos)               /* (SQI_STAT2) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IO0 ,Bit4 - SPI_IO1 ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 Mask */
#define SQI_STAT2_SQID3(value)                (SQI_STAT2_SQID3_Msk & (_UINT32_(value) << SQI_STAT2_SQID3_Pos)) /* Assigment of value for SQID3 in the SQI_STAT2 register */
#define SQI_STAT2_CONAVAIL_Pos                _UINT32_(7)                                          /* (SQI_STAT2) Indicates the number of entries in Control Buffer remaining. NOTE: This field not present in Michigan Ax versions. Treat as Reserved. Position */
#define SQI_STAT2_CONAVAIL_Msk                (_UINT32_(0x7) << SQI_STAT2_CONAVAIL_Pos)            /* (SQI_STAT2) Indicates the number of entries in Control Buffer remaining. NOTE: This field not present in Michigan Ax versions. Treat as Reserved. Mask */
#define SQI_STAT2_CONAVAIL(value)             (SQI_STAT2_CONAVAIL_Msk & (_UINT32_(value) << SQI_STAT2_CONAVAIL_Pos)) /* Assigment of value for CONAVAIL in the SQI_STAT2 register */
#define SQI_STAT2_CMDSTAT_Pos                 _UINT32_(16)                                         /* (SQI_STAT2) Reflect the (internal state machine) CMD_INIT value. Indicates whether the controller is in Transmit/Receive/IDLE state. 2?b00 - IDLE ,2?b01 - Transmit ,2?b10 - Receive ,2?b11 - Reserved Position */
#define SQI_STAT2_CMDSTAT_Msk                 (_UINT32_(0x3) << SQI_STAT2_CMDSTAT_Pos)             /* (SQI_STAT2) Reflect the (internal state machine) CMD_INIT value. Indicates whether the controller is in Transmit/Receive/IDLE state. 2?b00 - IDLE ,2?b01 - Transmit ,2?b10 - Receive ,2?b11 - Reserved Mask */
#define SQI_STAT2_CMDSTAT(value)              (SQI_STAT2_CMDSTAT_Msk & (_UINT32_(value) << SQI_STAT2_CMDSTAT_Pos)) /* Assigment of value for CMDSTAT in the SQI_STAT2 register */
#define SQI_STAT2_Msk                         _UINT32_(0x000303FB)                                 /* (SQI_STAT2) Register Mask  */

